package Game;

public class Random {

	//くじの中身
	int [] r_data1 = {

			1,1,1,1,1,1,2,3,3,3,3,3,3,3,3,3,3,3,3,3,3,
			4,4,4,4,4,
			5,5,5,5,5,5,5,5,5,5,5,
			6,6,6,6,6,6,6,6,6,6,6,6,
	};

	int [] r_data2 = {

			1,1,1,1,1,1,1,1,1,1,1,1,1,1,
			2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,
			3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,
			4,4,4,4,4,4,4,
			5,5,5,5,
			6,
	};





//コンストラクタ--------------------------------
public Random(){


}

//------------------------------------
//乱数を発生
//------------------------------------
public int getRand(){
	int r = new java.util.Random().nextInt(6)+1;
	return r;
}

//------------------------------------
//乱数を発生
//（データから引く）
//------------------------------------
	public int getRand1(){
		int len = r_data2.length;

		int p = new java.util.Random().nextInt(len);
		int r = r_data2[p];
		return r;
	}


}
